Repository: common-repository/audit-your-ads-on-google-by-clever-ads
Catalog: languages/wp-plugins-audit-your-ads-on-google-by-clever-ads-stable-readme-*.po
Languages: es

source: At Clever Ads, we know that taking care of your Google Ads campaigns and keeping them optimized is not a piece of cake. There are so many things to kn &hellip;
es: En Clever Ads sabemos que mantener tus campañas de Google Ads optimizadas no es nada fácil. Se necesitan muchos conocimientos y es todo un reto tenerlo todo bajo control. Sin embargo, es de vital importancia ya que el nivel de optimización de tus campañas tendrá un impacto directo sobre tu presupuesto y tu ROI.

source: Audit your Ads on Google by Clever Ads
es: Auditoría de anuncios de Google de Clever Ads

source: For applying some other suggestions you'll have to take action and make the changes directly on your Google Ads account interface.
es: En aquellos casos que no sea así te daremos instrucciones detalladas de como hacerlo desde tu cuenta de Google Ads.

source: Clever Ads audit report will have some instantly applicable suggestions, that you will be able to make in just a click. We will take care of making those specific changes on your Google Ads account automatically.
es: Clever Ads te permitirá implementar la mayoría de ideas y recomendaciones instantáneamente en un click.

source: Definitely. Select one Google Ads account at a time for getting its audit report. You can repeat this process as many times as you want with as many Google Ads account as you need. And yup! Still for free.
es: ¡Por supuesto! No podrás hacerlo a la vez pero podrás cambiar de cuenta y ver tu auditoría para cada una de ellas. ¡Si! Gratis.

source: Yayy! Clever Ads audits your Google Ads campaigns for free. At Clever Ads we believe everyone should have access to well-performing ads, no matter their budget.
es: ¡Así es! Auditamos tus campañas de anuncios de Google de forma gratuita. En Clever Ads creemos que todo el mundo debe tener acceso a anunciarse con campañas bien optimizadas, sin importar su presupuesto.

source: It normally takes a few minutes, and even seconds, to have your Google Ads campaigns analyzed.
es: Normalmente tarda pocos minutos, e incluso segundos. Si tarda más te daremos la posibilidad de darnos tu correo electrónico para avisarte de cuando esté lista.

source: Clever Ads is currently able to audit Google Ads campaigns in English, French, German, Italian, Portuguese and Spanish.
es: Clever Ads puede puede auditar campañas en alemán, español, francés, italiano y portugués.

source: You need to have an active Google Ads account with paused or active campaigns that we can analyze for providing you with the best insights and tailor-made suggestions for you to improve their performance.
es: Necesitarás una cuenta de Google Ads con campañas pausadas o activas que podamos analizar para ofrecerte las mejores ideas y recomendaciones personalizadas con el objetivo de que mejores tus resultados.

source: Do I need to apply the improvements and changes myself?
es: ¿Cómo implemento las ideas y recomendaciones que me ofrezca Clever Ads?

source: Can I audit campaigns from more than one Google Ads account?
es: ¿Puedo auditar campañas de más de una cuenta de Google Ads?

source: Does Clever Ads really audit my Google Ads campaigns 100% for free?
es: ¿El servicio de auditoría de Google Ads de Clever Ads es 100% gratuito?

source: How much time do you need to audit my Google Ads campaigns?
es: ¿Cuanto tiempo tarda en completarse la auditoría?

source: What languages are compatible with Clever Ads?
es: ¿Qué idiomas son compatibles con Clever Ads?

source: Do I need a Google Ads account?
es: ¿Necesito una cuenta de Google Ads?

source: <strong>Understand where you stand and make the right improvements instantly. Save money and maximize your ROI!</strong>
es: Aprenderás en qué punto se encuentran tus campañas y cómo hacer las mejoras correctas de forma instantánea. ¡Ahorra dinero mientras les sacas el máximo partido!

source: That's all! Your Google Ads Audit will be ready within a few seconds.
es: ¡Eso es todo! Tu auditoría estará lista en unos segundos.

source: <strong>Give Clever Ads access to your Google Ads account</strong> so we can perform a complete Google Ads Audit of your campaigns. The process is 100% safe and secure.
es: <strong>Danos acceso a tu cuenta de anuncios de Google</strong> para que podamos analizar tus campañas para ofrecerte las mejores sugerencias personalizadas. El proceso es 100% seguro.

source: Go to: <strong>Plugins &gt; Audit your Ads on Google by Clever Ads</strong>.
es: Ve a <strong>Plugins &gt; Auditoría de anuncios de Google de Clever Ads</strong>.

source: This module is compliant with the European General Data Protection Regulation <a href="https://cleverads.com/privacy-policy">https://cleverads.com/privacy-policy</a>
es: Este módulo cumple con la Regulación Europea General de Protección de Datos <a href="https://cleverads.com/privacy-policy">https://cleverads.com/privacy-policy</a>

source: <strong>Legal compliance</strong> GDPR compliance
es: <strong>Cumplimiento Legal</strong> Cumple con la GDPR

source: Improving your Google Ads account has never been easier. Get your Google Ads campaigns on point with the guarantee of a Premier Google Partner. At Clever Ads we're always launching new free products for leveraging your Google Ads strategy while saving you money and time, stay tuned at cleverads.com!
es: Mejorar y optimizar tu cuenta de Google Ads nunca ha sido tan fácil. Ten tus campañas siempre a punto con la garantía de un Premier Google Partner. En Clever Ads siempre estamos lanzando nuevos productos gratuitos para mejorar tu estrategia publicitaria en Google mientras ahorras dinero y tiempo. ¡Entérate de todo en cleverads.com!

source: <strong>Applicable Insights</strong>: The report Clever Ads generates for you is full of applicable insights so you can make improvements instantly. Increase or decrease bids, add keywords, optimize your targeting... in just one click!
es: <strong>Implementación en un click</strong>: El informe que generaremos en tu panel de control tendrá muchas ideas y consejos que podrás implementar instantáneamente. Aumenta o disminuye pujas, añade palabras clave, optimiza la orientación de tus campañas, ¡todo en un click!

source: <strong>Optimize your Google Ads at all levels</strong>: Get recommendations and insights at a campaign, ad group and keyword level. Do you have inefficient campaigns? Are you missing ads in your ad groups? Which keywords that are converting the most? Which should be removed from your campaigns? You'll know it all.
es: <strong>Optimiza tu cuenta a todos los niveles</strong>: Te haremos recomendaciones y te daremos ideas a nivel de campaña, grupo de anuncios, anuncios y palabras clave. ¿Tienes campañas ineficientes? ¿Tienes grupos de anuncios incompletos? ¿Qué palabras clave están convirtiendo mejor y cuáles deben ser eliminadas de tus campañas? ¡Lo sabrás todo!

source: <strong>Bidding Improvement Suggestions</strong>: Learn which keywords, ads and campaigns are underperforming and adjust your bids accordingly. Discover your least profitable products, non effective display placements and other relevant metrics.
es: <strong>Sugerencias de mejora de pujas</strong>: Te indicaremos qué palabras clave, anuncios y campañas están funcionando por debajo de lo que deberían y te recomendaremos ajustar las pujas acorde. Descubre qué productos o servicios se anuncian peor, ubicaciones de display poco efectivas y otros datos interesantes.

source: <strong>Your Google Ads overall score</strong>: Clever Ads will score your account out of 100 points. This way you'll learn where you stand and how far you are from having highly optimized Google Ads campaigns. This grade is based on key metrics such as your bidding strategy, quality score, keywords performance and other relevant data.
es: <strong>Puntuará tus Google Ads</strong>: Clever Ads le pondrá nota a tu cuenta del 0 al 100. De esta forma te harás una idea rápida del estado de tu cuenta y cuánto te queda para tenerla optimizada. Esta puntuación estará basada en tus métricas clave, estrategia de pujas, nivel de calidad, rendimiento de palabras clave y otros datos relevantes.

source: <strong>Features: What will you get?</strong>
es: <strong>Funcionalidades: ¿Qué me ofrecerá Clever Ads?</strong>

source: Performing a deep analysis and optimization of your Google Ads account at least once a month will allow you to save money and maximize your ROI.
es: Realizar un análisis profundo de tus campañas al menos una vez al mes te ayudará a ahorrar dinero y maximizar tus resultados. ¡Ten tus campañas siempre a punto!

source: <strong>How to get started with Clever Ads Audit?</strong>
es: <strong>¿Cómo empezar a usar la Auditoría de Clever Ads?</strong>

source: Join the 100,000 businesses worldwide that have already used Clever Ads Google Ads Audit!
es: ¡Únete a las más de 100,000 empresas de todo el mundo que ya han usado la auditoría de campañas de Google Ads de Clever Ads!

source: <strong>Don't miss a thing</strong>: Inefficient campaigns? Missing ads? Outperforming keywords? Be in charge and always know what to do next to reach the best ROI possible.
es: <strong>No te pierdas nada</strong>: ¿Campañas ineficientes? ¿Palabras clave no deseadas? ¿Anuncios incompletos? Tenlo todo bajo control. Con Clever Ads siempre sabrás cuál es el próximo paso a dar para conseguir el mejor ROI posible.

source: <strong>Save time</strong>: Instantly optimize your Google Ads campaigns with applicable insights. You will be able to apply Clever Ads improvements right away. No need to spend hours reviewing your Google Ads account anymore.
es: <strong>Ahorra tiempo</strong>: Optimiza tus anuncios de Google instantáneamente. Podrás implementar la mayoría de las mejoras que te mostramos en un click. Olvídate de pasar horas revisando tu cuenta de Google Ads.

source: <strong>Stop wasting money</strong>: Clever Ads Audit will detect which campaigns and keywords are underperforming and making you waste money while helping you improve your results.
es: <strong>Deja de perder dinero</strong>: Clever Ads detectará qué campañas, anuncios y palabras clave están consumiedo tu presupuesto sin dar buenos resultados, y te ayudará a mejorar su rendimiento.

source: <strong>Why use Clever Ads' Free Google Ads Audit?</strong>
es: <strong>¿Para qué utilizar la Auditoría gratuíta de anuncios de Google de Clever Ads?</strong>

source: Understand where you stand and make the right improvements instantly, our tips are applicable directly from our dashboard!
es: Aprenderás en qué punto se encuentran tus campañas y cómo hacer las mejoras correctas de forma instantánea desde tu panel de control.

source: We'll automatically perform a complete Google Ads Audit of your campaigns &amp; provide you with the best insights and optimization suggestions.
es: En unos segundos realizaremos una auditoría completa de todas tus campañas y te daremos las mejores ideas y consejos para optimizarlas.

source: Sign in on Google and select the Google Ads account you want to have analyzed by Clever Ads.
es: Inicia sesión en tu cuenta de Google y selecciona la cuenta de Google Ads que quieras que analicemos.
